# Import NYC Traffic Data from CSV Into Dataframe

In [1]:
#Import Dependencies
import pandas as pd
import os

In [24]:
#import CSV File
nyc_csv = os.path.join("..", "data", "rawdata", "NYPD_Motor_Vehicle_Collisions.csv")

csv = pd.read_csv(nyc_csv, low_memory=False)

In [25]:
df = pd.DataFrame(csv)
df.nunique()

DATE                                2450
TIME                                1440
BOROUGH                                5
ZIP CODE                             231
LATITUDE                          113257
LONGITUDE                          90779
LOCATION                          193779
ON STREET NAME                     11137
CROSS STREET NAME                  17514
OFF STREET NAME                   123048
NUMBER OF PERSONS INJURED             27
NUMBER OF PERSONS KILLED               7
NUMBER OF PEDESTRIANS INJURED         13
NUMBER OF PEDESTRIANS KILLED           4
NUMBER OF CYCLIST INJURED              5
NUMBER OF CYCLIST KILLED               3
NUMBER OF MOTORIST INJURED            27
NUMBER OF MOTORIST KILLED              6
CONTRIBUTING FACTOR VEHICLE 1         61
CONTRIBUTING FACTOR VEHICLE 2         61
CONTRIBUTING FACTOR VEHICLE 3         49
CONTRIBUTING FACTOR VEHICLE 4         39
CONTRIBUTING FACTOR VEHICLE 5         27
UNIQUE KEY                       1462114
VEHICLE TYPE CODE 1                  611
VEHICLE TYPE CODE 2                  559
VEHICLE TYPE CODE 3                  119
VEHICLE TYPE CODE 4                   68
VEHICLE TYPE CODE 5                   44
dtype: int64

In [26]:
df.head()
df.dtypes

DATE                              object
TIME                              object
BOROUGH                           object
ZIP CODE                          object
LATITUDE                         float64
LONGITUDE                        float64
LOCATION                          object
ON STREET NAME                    object
CROSS STREET NAME                 object
OFF STREET NAME                   object
NUMBER OF PERSONS INJURED        float64
NUMBER OF PERSONS KILLED         float64
NUMBER OF PEDESTRIANS INJURED      int64
NUMBER OF PEDESTRIANS KILLED       int64
NUMBER OF CYCLIST INJURED          int64
NUMBER OF CYCLIST KILLED           int64
NUMBER OF MOTORIST INJURED         int64
NUMBER OF MOTORIST KILLED          int64
CONTRIBUTING FACTOR VEHICLE 1     object
CONTRIBUTING FACTOR VEHICLE 2     object
CONTRIBUTING FACTOR VEHICLE 3     object
CONTRIBUTING FACTOR VEHICLE 4     object
CONTRIBUTING FACTOR VEHICLE 5     object
UNIQUE KEY                         int64
VEHICLE TYPE CODE 1               object
VEHICLE TYPE CODE 2               object
VEHICLE TYPE CODE 3               object
VEHICLE TYPE CODE 4               object
VEHICLE TYPE CODE 5               object
dtype: object

In [27]:
df.head()

,DATE,TIME,BOROUGH,ZIP CODE,LATITUDE,LONGITUDE,LOCATION,ON STREET NAME,CROSS STREET NAME,OFF STREET NAME,...,CONTRIBUTING FACTOR VEHICLE 2,CONTRIBUTING FACTOR VEHICLE 3,CONTRIBUTING FACTOR VEHICLE 4,CONTRIBUTING FACTOR VEHICLE 5,UNIQUE KEY,VEHICLE TYPE CODE 1,VEHICLE TYPE CODE 2,VEHICLE TYPE CODE 3,VEHICLE TYPE CODE 4,VEHICLE TYPE CODE 5
0,03/16/2019,0:00,BROOKLYN,11208,40.681927,-73.870720,"(40.681927, -73.87072)",ATLANTIC AVENUE,HEMLOCK STREET,NaN,...,NaN,NaN,NaN,NaN,4098779,Station Wagon/Sport Utility Vehicle,NaN,NaN,NaN,NaN
1,03/16/2019,0:00,MANHATTAN,10016,40.749100,-73.984085,"(40.7491, -73.984085)",5 AVENUE,WEST 35 STREET,NaN,...,Driver Inattention/Distraction,NaN,NaN,NaN,4097559,Sedan,Garbage or Refuse,NaN,NaN,NaN
2,03/16/2019,0:00,QUEENS,11412,40.696064,-73.763084,"(40.696064, -73.763084)",MEXICO STREET,DORMANS ROAD,NaN,...,Unspecified,NaN,NaN,NaN,4098023,Sedan,Sedan,NaN,NaN,NaN
3,03/16/2019,0:00,NaN,NaN,40.841843,-73.945390,"(40.841843, -73.94539)",HENRY HUDSON PARKWAY,NaN,NaN,...,Unspecified,NaN,NaN,NaN,4098377,Sedan,Taxi,NaN,NaN,NaN
4,03/16/2019,0:00,BRONX,10451,40.811733,-73.926700,"(40.811733, -73.9267)",MORRIS AVENUE,EAST 139 STREET,NaN,...,Unspecified,NaN,NaN,NaN,4097667,Sedan,Sedan,NaN,NaN,NaN

In [77]:
#Which columns are not important 
#'ON STREET NAME', 'CROSS STREET NAME', 'OFF STREET NAME', 'UNIQUE KEY'
#df['CONTRIBUTING FACTOR VEHICLE 5'].value_counts(0)
new = df.filter(['DATE', 'BOROUGH', 'LATITUDE', 'LONGITUDE', 'NUMBER OF PERSONS INJURED', 'NUMBER OF PERSONS KILLED'], axis=1)
new.head()

,DATE,BOROUGH,LATITUDE,LONGITUDE,NUMBER OF PERSONS INJURED,NUMBER OF PERSONS KILLED
0,03/16/2019,BROOKLYN,40.681927,-73.870720,0.0,0.0
1,03/16/2019,MANHATTAN,40.749100,-73.984085,0.0,0.0
2,03/16/2019,QUEENS,40.696064,-73.763084,0.0,0.0
3,03/16/2019,NaN,40.841843,-73.945390,0.0,0.0
4,03/16/2019,BRONX,40.811733,-73.926700,1.0,0.0

In [88]:
new.head()
new.dtypes

DATE                          object
BOROUGH                       object
LATITUDE                     float64
LONGITUDE                    float64
NUMBER OF PERSONS INJURED    float64
NUMBER OF PERSONS KILLED     float64
dtype: object

In [89]:
renamed = new.rename(columns={"NUMBER OF PERSONS INJURED":"INJURED", "NUMBER OF PERSONS KILLED":"KILLED"})

In [90]:
renamed.head()

         DATE    BOROUGH   LATITUDE  LONGITUDE  INJURED  KILLED
0  03/16/2019   BROOKLYN  40.681927 -73.870720      0.0     0.0
1  03/16/2019  MANHATTAN  40.749100 -73.984085      0.0     0.0
2  03/16/2019     QUEENS  40.696064 -73.763084      0.0     0.0
3  03/16/2019        NaN  40.841843 -73.945390      0.0     0.0
4  03/16/2019      BRONX  40.811733 -73.926700      1.0     0.0

In [94]:
borough = renamed.dropna()
borough.head()

         DATE    BOROUGH   LATITUDE  LONGITUDE  INJURED  KILLED
0  03/16/2019   BROOKLYN  40.681927 -73.870720      0.0     0.0
1  03/16/2019  MANHATTAN  40.749100 -73.984085      0.0     0.0
2  03/16/2019     QUEENS  40.696064 -73.763084      0.0     0.0
4  03/16/2019      BRONX  40.811733 -73.926700      1.0     0.0
7  03/16/2019     QUEENS  40.758316 -73.910690      1.0     0.0

In [115]:
clean = borough

In [116]:
clean.head()

         DATE    BOROUGH   LATITUDE  LONGITUDE  INJURED  KILLED
0  03/16/2019   BROOKLYN  40.681927 -73.870720      0.0     0.0
1  03/16/2019  MANHATTAN  40.749100 -73.984085      0.0     0.0
2  03/16/2019     QUEENS  40.696064 -73.763084      0.0     0.0
4  03/16/2019      BRONX  40.811733 -73.926700      1.0     0.0
7  03/16/2019     QUEENS  40.758316 -73.910690      1.0     0.0

In [127]:
clean.count()
cleaned_csv = clean.to_csv(os.path.join('..', 'data', 'cleandata', 'nyc_clean.csv'), header=True)

In [1]:
time = "1388534400"
lat = "40.6870226"
lng = "-73.7659469"
key = "YOURKEYHERE"
exclude = "currently,flags,alerts,minutely,hourly"
units = "us"
url = f'https://api.darksky.net/forecast/{key}/{lat},{lng},{time}?exclude={exclude}?units={units}'

print(url)

https://api.darksky.net/forecast/YOURKEYHERE/40.6870226,-73.7659469,1388534400?exclude=currently,flags,alerts,minutely,hourly?units=us